package com.dell.yangzhou.ClassDemo;

/*
 * 面向过程(pop)和面向对象(oop)
 * procedure oriented programing
 * Object oriented programing
 *
 * 面向过程的思想强调的步骤
 * 面向对象的思想强调的执行者
 *
 * 面向对象的思想如何落地：
 *   1.根据问题需要，选择问题所针对的现实世界中的实体
 *   2.从实体中寻找解决问题相关的属性和功能，这些属性和功能就形成了概念世界中的类。
 *   3.把抽象的实体用计算机语言进行描述，形成计算机世界中类的定义。即借助某种程序语言，把类构造成计算机能够识别和处理的数据结构。
 *   4.将类实例化成计算机世界中的对象。对象是计算机世界中解决问题的最终工具。
 *
 *   类和对象：
 *       类是指一类事物的描述和抽象
 *       对象是实际存在的某一类事物的个体，也被称作实例（instance）
 *
 *   面向对象的学习内容：
 *       1.类和对象：
 *           类的定义
 *               属性、方法（功能）
 *               属性：人的年龄、身高、性别
 *               方法：人会走路、会写代码、会讲英语
 *           对象的创建
 *               具体的某一类的实例
 *               需要这个具体的实例完成我们的功能
 *      2. 面向对象的三大特征
 *           封装
 *           继承
 *           多态
 *       3.其他关键字
 *           class
 *           return
 *
 *       属性
 *           基本数据类型
 *           引用数据类型
 *       方法的组成：
 *           1.返回值：基本数据类型、引用数据类型或void
 *           2.形参：形式参数
 *       访问修饰符：
 *           public、default、protected、private
 *
 * */
public class ClassTest {
    public static void main(String[] args) {
        //根据定义的类，来创建实例对象
//
//        //使用对象名.属性或方法来访问对象的内容
//        System.out.println(zhangsan.sex);
//

    }
}

